## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T21:47:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:12/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.zip"
      ~ s3_object_version              = "qdOx8JjtTIk77b2mgeVIhgRnBkZZ0zIn" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1998ebc08a79d6ebe5213d96b613f018-2" -> (known after apply)
      ~ id                     = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> (known after apply)
      ~ key                    = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.zip"
-       tags                   = {} -> null
      ~ version_id             = "qdOx8JjtTIk77b2mgeVIhgRnBkZZ0zIn" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7295082756956721199" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.zip"
          ~ "timestamp" = "1688161614604058000" -> "1689125837476227000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1861815578349962383" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4d9229ca40e9ee86b4685097d2599e12b595b89703a2293689d642e923b53193.zip" -> "builds/7496324af5508b0f4e90536a8420d5bbbb34735d30c186547d64c5c64a3263cf.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-06-30T21:47:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:37" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:37/invocations" -> (known after apply)
      ~ s3_key                         = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.zip"
      ~ s3_object_version              = "YjEjYfLRd2akg2KniJa5KpO1AUDZsnEr" -> (known after apply)
        tags                           = {}
      ~ version                        = "37" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "37" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d3e5fe9bfd6144f96ef7b9e8bcba9aab-2" -> (known after apply)
      ~ id                     = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> (known after apply)
      ~ key                    = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.zip"
-       tags                   = {} -> null
      ~ version_id             = "YjEjYfLRd2akg2KniJa5KpO1AUDZsnEr" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5394636694715610358" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.zip"
          ~ "timestamp" = "1688161597007071000" -> "1689125818656679000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1795306918265251547" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/42fb910a803369e626f2727acdb0773014e465e5b0ba77a51263c8946b701de5.zip" -> "builds/72abc9ce429568c6322b5e92d007892caf802d9dc2453c88ecb88b9befc48c5a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-06-30T21:47:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:17/invocations" -> (known after apply)
      ~ s3_key                         = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.zip"
      ~ s3_object_version              = "QS38Cs66XSoLSTyxYCw47p_o.A4KTdfA" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "17" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "dec1336ef9c38ea8df6b7cc374fc98d2-2" -> (known after apply)
      ~ id                     = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> (known after apply)
      ~ key                    = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.zip"
-       tags                   = {} -> null
      ~ version_id             = "QS38Cs66XSoLSTyxYCw47p_o.A4KTdfA" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6086997738311947235" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.zip"
          ~ "timestamp" = "1688161614908956000" -> "1689125837632263000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8841688867235743131" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/db7940afe72c98644c1af0e578d61ccf4b964442fb0aae704ef95b4f77a80ab3.zip" -> "builds/cd5c4d74879df430e925794da9dd2ee1d3975b9f2700bf21cc09671f16297f07.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-06-30T21:47:26.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:6/invocations" -> (known after apply)
      ~ s3_key                         = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.zip"
      ~ s3_object_version              = "Q5fzSFD_1ZXCaY2rawp7qYn.7Mq0jkqh" -> (known after apply)
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "6" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "65d572034ee0f4ec5433d9ef164f1b5f-2" -> (known after apply)
      ~ id                     = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> (known after apply)
      ~ key                    = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.zip"
-       tags                   = {} -> null
      ~ version_id             = "Q5fzSFD_1ZXCaY2rawp7qYn.7Mq0jkqh" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4734243358249661584" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.zip"
          ~ "timestamp" = "1688161615000353000" -> "1689125837691600000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6120901226582440205" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/6b383c1ed612793cb2cf53e1b0143090af450bacf35e050c5fab1f6abbfa45df.zip" -> "builds/23b58f29ca60deebef2ce4e1381ac5f27d3afb5c18deb88b658acc24ef868e1c.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-06-30T21:47:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:7/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.zip"
      ~ s3_object_version              = "XI9iN7EQaQPWfXGdIbLExyObx6wgaNaR" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fd6df1559037be61724833b3ca7aa19a-2" -> (known after apply)
      ~ id                     = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> (known after apply)
      ~ key                    = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.zip"
-       tags                   = {} -> null
      ~ version_id             = "XI9iN7EQaQPWfXGdIbLExyObx6wgaNaR" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8262814561860869913" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.zip"
          ~ "timestamp" = "1688161614805339000" -> "1689125837483090000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7733053324889639600" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9a5a2a1390db3ffcb480b8a7cb5cadcde43d297f4090b8354371578f668cb602.zip" -> "builds/bd7eae6a5215a3cdcb3839d759f31ec239e14e7de37da1d2aebbfe8795a54332.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T21:47:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:9" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:9/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.zip"
      ~ s3_object_version              = "2O.8ut94ffxYIbidtTNHo9JW5A3KRIK6" -> (known after apply)
        tags                           = {}
      ~ version                        = "9" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "9" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "54ffe07547bf85bc9dd80e7ba33b639a-2" -> (known after apply)
      ~ id                     = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> (known after apply)
      ~ key                    = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.zip"
-       tags                   = {} -> null
      ~ version_id             = "2O.8ut94ffxYIbidtTNHo9JW5A3KRIK6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3750911065083810628" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.zip"
          ~ "timestamp" = "1688161596644356000" -> "1689125818722237200"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "317247775631938488" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0c9a080c9198f7eddd4a4076f6698be4ae4ab63a958f67430d79f83099e12a21.zip" -> "builds/33f5703759deb98426fcf46f704a8821c31a53190873f31896fd29a9281096e9.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-06-30T21:47:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:8/invocations" -> (known after apply)
      ~ s3_key                         = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.zip"
      ~ s3_object_version              = "1l1Dx4a92qmy19ewDqCdlh1Pl2dsfvun" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0181913ba32855d2d7a81745305be4e4-2" -> (known after apply)
      ~ id                     = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> (known after apply)
      ~ key                    = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.zip"
-       tags                   = {} -> null
      ~ version_id             = "1l1Dx4a92qmy19ewDqCdlh1Pl2dsfvun" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3505989702210606467" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.zip"
          ~ "timestamp" = "1688161614709523000" -> "1689125837725653800"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3564569430013289707" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/aff63d37b4f0cbe67d246555a2edf691a1ff00b9e1b07ef2624fdf3623068c66.zip" -> "builds/cdf01083253b0530d9e0de16af22b4b17ce9f0221658d6c4ef41854f90bcb4bd.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-30T21:47:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:36" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:36/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.zip"
      ~ s3_object_version              = "26n5E_3ZABjcvlUFrsGZSQZ1gDf5AQ5X" -> (known after apply)
        tags                           = {}
      ~ version                        = "36" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:fa078c0b3f8b7b0eccfd558fad0737e4936158b1,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:6e94c096d63dbb8fe17a3bcbacf807a55fe48d07,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "fa078c0b3f8b7b0eccfd558fad0737e4936158b1" -> "6e94c096d63dbb8fe17a3bcbacf807a55fe48d07"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "36" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e58d8357699231f8838af5cac611dbee-2" -> (known after apply)
      ~ id                     = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> (known after apply)
      ~ key                    = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.zip"
-       tags                   = {} -> null
      ~ version_id             = "26n5E_3ZABjcvlUFrsGZSQZ1gDf5AQ5X" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1756512890612805212" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.zip"
          ~ "timestamp" = "1688161596966590000" -> "1689125818302999000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1791331425328214692" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3d8dc7f36f59fa305ea9101035b91b5b196d34573b1de24ee6f1e40fa16ce696.zip" -> "builds/5a9b92e579670de639f9dc35c53392643f74d4cdd1e3d9859839958169a69a85.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 40 to add, 13 to change, 32 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5526595726)*